In [7]:
import pandas as pd

data1 = {
    'Name': ["Sarvesh", "Anurag", "Sohan", "Ojas"],
    'Math': [91, 92, 87, 77],
    'English': [81, 97, 82, 90],
}

data2 = {
    'Name': ["Anisha", "2 2", "Jayanti", "Abhishek"],
    'Maths': [71, 56, 67, 97],
    'English': [99, 76, 92, 60],
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

concatData = pd.concat([df1,df2])

concatData

       Name  Math  English  Maths
0   Sarvesh  91.0       81    NaN
1    Anurag  92.0       97    NaN
2     Sohan  87.0       82    NaN
3      Ojas  77.0       90    NaN
0    Anisha   NaN       99   71.0
1       2 2   NaN       76   56.0
2   Jayanti   NaN       92   67.0
3  Abhishek   NaN       60   97.0

In [7]:
s = pd.Series(["Science", "Technology", "Engineering", "Mathematics"], name="event");
pd.concat([s, df1])

            Math    English
count   4.000000   4.000000
mean   86.750000  87.500000
std     6.849574   7.505553
min    77.000000  81.000000
25%    84.500000  81.750000
50%    89.000000  86.000000
75%    91.250000  91.750000
max    92.000000  97.000000

In [9]:
iplTeamData = {
    "Team": ["CSK", "MI", "RCB", "RR", "PBK", "DC", "KKR","SRH" , "LSG", "GT"],
    "Rank": [1, 2, 8, 4, 9, 3, 7, 6, 5, 10],
    "WinnerYear": [2023, 2019, "N/A", 2008, "N/A", "N/A", 2014, 2016, "N/A", 2022],
    "Points": [100, 90, 80, 70, 60, 50, 40 ,30, 20, 10],
}

teamsTable = (pd.DataFrame(iplTeamData))
teamsTable.sort_values("Rank")

  Team  Rank WinnerYear  Points
0  CSK     1       2023     100
1   MI     2       2019      90
5   DC     3        N/A      50
3   RR     4       2008      70
8  LSG     5        N/A      20
7  SRH     6       2016      30
6  KKR     7       2014      40
2  RCB     8        N/A      80
4  PBK     9        N/A      60
9   GT    10       2022      10

In [17]:
teamsTable['Team'].value_counts()

Team
CSK    1
MI     1
RCB    1
RR     1
PBK    1
DC     1
KKR    1
SRH    1
LSG    1
GT     1
Name: count, dtype: int64